## Exercises I

In [15]:
import pandas as pd
import numpy as np
from env import get_db_url

In [18]:
url = get_db_url("employees")
sql = """
SELECT * FROM employees
"""
em = pd.read_sql(sql, url)
em.shape

(300024, 6)

#### 5. Once you have successfully run a query:

a. Intentionally make a typo in the database url. What kind of error message do you see?

b. Intentionally make an error in your SQL query. What does the error message look like?

In [3]:
# depending on the error made the message of error changes. Example : NoSuchModuleError: Can't load plugin: sqlalchemy.dialects:mysql.pymsql

# It makes this error for the SQL querry: ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'employees.employs' doesn't exist")
#[SQL: SELECT * FROM employs LIMIT 5 OFFSET 50]
#(Background on this error at: https://sqlalche.me/e/14/f405)

#### 6. Read the employees and titles tables into two separate DataFrames.
AND
#### 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [19]:
em.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [21]:
em.shape

(300024, 6)

In [27]:
sql = """
SELECT * FROM titles
"""

titles = pd.read_sql(sql, url)
ttl = titles
ttl.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [28]:
ttl.shape

(443308, 4)

#### 8. Display the summary statistics for each DataFrame.

In [24]:
em.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [29]:
ttl.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

#### 9. How many unique titles are in the titles DataFrame?

In [32]:
len(ttl.title.unique())

7

#### 10. What is the oldest date in the to_date column?

In [34]:
ttl.to_date.min()

datetime.date(1985, 3, 1)

#### 11. What is the most recent date in the to_date column?

In [35]:
ttl.to_date.max()

datetime.date(9999, 1, 1)

## Exercises II

#### 1. Copy the users and roles DataFrames from the examples above.

In [39]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [40]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [41]:
pd.concat([users, roles], axis=0)

   id       name  role_id
0   1        bob      1.0
1   2        joe      2.0
2   3      sally      3.0
3   4       adam      3.0
4   5       jane      NaN
5   6       mike      NaN
0   1      admin      NaN
1   2     author      NaN
2   3   reviewer      NaN
3   4  commenter      NaN

#### 2. What is the result of using a right join on the DataFrames?

#### 3. What is the result of using an outer join on the DataFrames?

#### 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?